Revit 2027 API
Entity.Set<FieldType>(Field, FieldType, ForgeTypeId) Method
 Stores the value of the field in the entity.
Namespace: Autodesk.Revit.DB.ExtensibleStorage
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void Set<FieldType>(
	Field field,
	FieldType value,
	ForgeTypeId unitTypeId
)
Public Sub Set(Of FieldType) (
	field As Field,
	value As FieldType,
	unitTypeId As ForgeTypeId
)
public:
generic<typename FieldType>
void Set(
	Field^ field,
	FieldType value,
	ForgeTypeId^ unitTypeId
)
member Set :
        field : Field *
        value : 'FieldType *
        unitTypeId : ForgeTypeId -> unit
Parameters
field Field
 The field to update.
value FieldType
unitTypeId ForgeTypeId
 Identifier of the unit from which the value will be converted before storing. Must be compatible with the spec specified when creating the Schema.
Type Parameters
FieldType
 The type of the field
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was NULL
InvalidOperationException |  The Field belongs to a different Schema from this Entity, or this Entity is invalid.
ArgumentException |  Requested type does not match the field type.
ArgumentException |  The unitTypeId value is not compatible with the field description.
ArgumentException |  This field's subschema prevents writing.
ArgumentException |  Invalid floating-point value.
Remarks
 The template parameter must match the type of the field (specified when creating the Schema) exactly; this method does not perform data type conversions. The types for containers are IList for arrays and IDictionary for maps.
 This method only modifies your copy of the Entity. Store the Entity in an element or another Entity to save the new value. Write access check is not performed on each call to Set. Instead, write access is checked when you try to save the Entity in an Element or another Entity.
See Also
Reference
Entity Class
Set Overload
Autodesk.Revit.DB.ExtensibleStorage Namespace